In [1]:
import pandas as pd`

In [11]:
!cd Microsoft_Movie_Analysis/data/bom.movie_gross 2.csv

zsh:cd:1: string not in pwd: Microsoft_Movie_Analysis/data/bom.movie_gross

In [12]:
Movies_accounts1 =pd.read_csv('./data/bom.movie_gross 2.csv')

In [48]:
Movies_accounts1.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [14]:
Movies_accounts1.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [15]:
Movies_accounts1.tail()

,title,studio,domestic_gross,foreign_gross,year
3382,The Quake,Magn.,6200.0,NaN,2018
3383,Edward II (2018 re-release),FM,4800.0,NaN,2018
3384,El Pacto,Sony,2500.0,NaN,2018
3385,The Swan,Synergetic,2400.0,NaN,2018
3386,An Actor Prepares,Grav.,1700.0,NaN,2018

In [16]:
Movies_accounts1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [17]:
Movies_accounts1.describe()

       domestic_gross         year
count    3.359000e+03  3387.000000
mean     2.874585e+07  2013.958075
std      6.698250e+07     2.478141
min      1.000000e+02  2010.000000
25%      1.200000e+05  2012.000000
50%      1.400000e+06  2014.000000
75%      2.790000e+07  2016.000000
max      9.367000e+08  2018.000000

In [19]:
Movies_accounts1["title"].value_counts()

Bluebeard                                2
Film Socialisme                          1
To Rome with Love                        1
Cirkus Columbia                          1
The Second Best Exotic Marigold Hotel    1
                                        ..
The Concert                              1
A Ciambra                                1
A Simple Favor                           1
Get On Up                                1
Strangerland                             1
Name: title, Length: 3386, dtype: int64

In [20]:
Movies_accounts1["studio"].value_counts()

IFC         166
Uni.        147
WB          140
Magn.       136
Fox         136
           ...
BSC           1
DR            1
Saban         1
GrtIndia      1
SEA           1
Name: studio, Length: 257, dtype: int64

In [21]:
Movies_accounts1["domestic_gross"].value_counts()

1100000.0      32
1000000.0      30
1300000.0      30
1200000.0      25
1400000.0      23
               ..
68800.0         1
87000000.0      1
739000.0        1
336000000.0     1
727000.0        1
Name: domestic_gross, Length: 1797, dtype: int64

In [25]:
Movies_accounts1["foreign_gross"].value_counts()

1200000     23
1100000     14
4200000     12
1900000     12
1300000     11
            ..
22800000     1
92200000     1
57500        1
754000       1
9100000      1
Name: foreign_gross, Length: 1204, dtype: int64

In [30]:
Movies_accounts1["year"].value_counts()

2015    450
2016    436
2012    400
2011    399
2014    395
2013    350
2010    328
2017    321
2018    308
Name: year, dtype: int64

In [31]:
Movies_accounts1.isna().sum()

title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

In [54]:
Movies = Movies_accounts1

Movies.head()

In [55]:
Movies.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [56]:
Movies["Title"] = Movies["title"]

In [62]:
Movies.drop(['title'], axis=1)

,studio,domestic_gross,foreign_gross,year,Title
0,BV,415000000.0,652000000,2010,Toy Story 3
1,BV,334200000.0,691300000,2010,Alice in Wonderland (2010)
2,WB,296000000.0,664300000,2010,Harry Potter and the Deathly Hallows Part 1
3,WB,292600000.0,535700000,2010,Inception
4,P/DW,238700000.0,513900000,2010,Shrek Forever After
...,...,...,...,...,...
3382,Magn.,6200.0,NaN,2018,The Quake
3383,FM,4800.0,NaN,2018,Edward II (2018 re-release)
3384,Sony,2500.0,NaN,2018,El Pacto
3385,Synergetic,2400.0,NaN,2018,The Swan
3386,Grav.,1700.0,NaN,2018,An Actor Prepares

In [66]:
Movies_without_foreign_gross = Movies.foreign_gross.isna()

In [68]:
!pwd

/Users/brianm/Documents/Flatiron/DataScience/Project/Two/Microsoft_Movie_Analysis